In [2]:
# Data Loading

In [3]:
import pandas as pd

In [4]:
excel_path = "Store Data.xlsx"

fact_df = pd.read_excel(excel_path, sheet_name="Sheet3")
product_df = pd.read_excel(excel_path, sheet_name="Dim Product")
customer_df = pd.read_excel(excel_path, sheet_name="Dim Customers")
promotion_df = pd.read_excel(excel_path, sheet_name="Dim Promotion")

In [5]:
pd.read_excel(excel_path, sheet_name="Sheet3")

,Date (dd/mm/yyyy),CustomerID,PromotionID,Product ID,Units Sold,Price Per Unit,Total Sales,Discount Percentage,Discount Value,Net Sales
0,2020-02-04,10,0,P004,2,NaN,NaN,NaN,NaN,NaN
1,2022-05-19,28,PR001,P027,3,NaN,NaN,NaN,NaN,NaN
2,2022-07-01,2,0,P011,3,NaN,NaN,NaN,NaN,NaN
3,2022-04-06,11,PR001,P009,2,NaN,NaN,NaN,NaN,NaN
4,2022-01-02,34,0,P002,1,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
3505,2022-03-10,42,0,P001,2,NaN,NaN,NaN,NaN,NaN
3506,2022-05-09,44,PR001,P024,1,NaN,NaN,NaN,NaN,NaN
3507,2020-11-30,31,0,P028,1,NaN,NaN,NaN,NaN,NaN
3508,2022-07-10,41,PR004,P020,1,NaN,NaN,NaN,NaN,NaN
3509,2022-10-01,6,0,P019,2,NaN,NaN,NaN,NaN,NaN

In [6]:
fact_df.head()

,Date (dd/mm/yyyy),CustomerID,PromotionID,Product ID,Units Sold,Price Per Unit,Total Sales,Discount Percentage,Discount Value,Net Sales
0,2020-02-04,10,0,P004,2,NaN,NaN,NaN,NaN,NaN
1,2022-05-19,28,PR001,P027,3,NaN,NaN,NaN,NaN,NaN
2,2022-07-01,2,0,P011,3,NaN,NaN,NaN,NaN,NaN
3,2022-04-06,11,PR001,P009,2,NaN,NaN,NaN,NaN,NaN
4,2022-01-02,34,0,P002,1,NaN,NaN,NaN,NaN,NaN

In [7]:
fact_df.shape

(3510, 10)

In [8]:
fact_df.columns

Index(['Date (dd/mm/yyyy)', 'CustomerID', 'PromotionID', 'Product ID',
       'Units Sold', 'Price Per Unit', 'Total Sales', 'Discount Percentage',
       'Discount Value', 'Net Sales'],
      dtype='object')

In [9]:
# Data Cleaning

In [10]:
fact_df = fact_df.rename(columns={
    'Date (dd/mm/yyyy)': 'Date'
})

In [11]:
fact_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3510 entries, 0 to 3509
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 3510 non-null   datetime64[ns]
 1   CustomerID           3510 non-null   int64
 2   PromotionID          3510 non-null   object
 3   Product ID           3510 non-null   object
 4   Units Sold           3510 non-null   int64
 5   Price Per Unit       0 non-null      float64
 6   Total Sales          0 non-null      float64
 7   Discount Percentage  0 non-null      float64
 8   Discount Value       0 non-null      float64
 9   Net Sales            0 non-null      float64
dtypes: datetime64[ns](1), float64(5), int64(2), object(2)
memory usage: 274.3+ KB

In [12]:
fact_df.isnull().sum()

Date                      0
CustomerID                0
PromotionID               0
Product ID                0
Units Sold                0
Price Per Unit         3510
Total Sales            3510
Discount Percentage    3510
Discount Value         3510
Net Sales              3510
dtype: int64

In [13]:
fact_df['Units Sold'].describe()

count    3510.000000
mean        2.029915
std         0.812740
min         1.000000
25%         1.000000
50%         2.000000
75%         3.000000
max         3.000000
Name: Units Sold, dtype: float64

In [14]:
fact_df[fact_df['Units Sold'] <= 0]

Empty DataFrame
Columns: [Date, CustomerID, PromotionID, Product ID, Units Sold, Price Per Unit, Total Sales, Discount Percentage, Discount Value, Net Sales]
Index: []

In [15]:
fact_df['Date'].min(), fact_df['Date'].max()

(Timestamp('2020-01-01 00:00:00'), Timestamp('2024-01-01 00:00:00'))

In [16]:
fact_df['CustomerID'].nunique()

50

In [17]:
customer_df['Customer ID'].nunique()

50

In [18]:
fact_df['Year'] = fact_df['Date'].dt.year
fact_df['Month'] = fact_df['Date'].dt.month
fact_df['Month Name'] = fact_df['Date'].dt.month_name()

In [19]:
product_df.head()

  ProductID        Product Name Product Line  Price (INR)
0      P001     Apple iPhone 14  Electronics        79999
1      P002  Samsung Galaxy S21  Electronics        69999
2      P003  Sony Bravia 55" TV  Electronics        89999
3      P004  HP Pavilion Laptop  Electronics        64999
4      P005   Apple MacBook Air  Electronics        92499

In [20]:
product_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ProductID     30 non-null     object
 1   Product Name  30 non-null     object
 2   Product Line  30 non-null     object
 3   Price (INR)   30 non-null     int64
dtypes: int64(1), object(3)
memory usage: 1.1+ KB

In [21]:
##name is not alligning name column name changing

In [22]:
fact_df = fact_df.rename(columns={
    'Product ID': 'ProductID'
})

In [23]:
fact_df = fact_df.merge(
    product_df[['ProductID', 'Price (INR)']],
    on='ProductID',
    how='left'
)

In [24]:
fact_df.head()

,Date,CustomerID,PromotionID,ProductID,Units Sold,Price Per Unit,Total Sales,Discount Percentage,Discount Value,Net Sales,Year,Month,Month Name,Price (INR)
0,2020-02-04,10,0,P004,2,NaN,NaN,NaN,NaN,NaN,2020,2,February,64999
1,2022-05-19,28,PR001,P027,3,NaN,NaN,NaN,NaN,NaN,2022,5,May,699
2,2022-07-01,2,0,P011,3,NaN,NaN,NaN,NaN,NaN,2022,7,July,1499
3,2022-04-06,11,PR001,P009,2,NaN,NaN,NaN,NaN,NaN,2022,4,April,3499
4,2022-01-02,34,0,P002,1,NaN,NaN,NaN,NaN,NaN,2022,1,January,69999

In [25]:
fact_df['Price Per Unit'] = fact_df['Price (INR)']

In [26]:
fact_df.head()

,Date,CustomerID,PromotionID,ProductID,Units Sold,Price Per Unit,Total Sales,Discount Percentage,Discount Value,Net Sales,Year,Month,Month Name,Price (INR)
0,2020-02-04,10,0,P004,2,64999,NaN,NaN,NaN,NaN,2020,2,February,64999
1,2022-05-19,28,PR001,P027,3,699,NaN,NaN,NaN,NaN,2022,5,May,699
2,2022-07-01,2,0,P011,3,1499,NaN,NaN,NaN,NaN,2022,7,July,1499
3,2022-04-06,11,PR001,P009,2,3499,NaN,NaN,NaN,NaN,2022,4,April,3499
4,2022-01-02,34,0,P002,1,69999,NaN,NaN,NaN,NaN,2022,1,January,69999

In [27]:
fact_df = fact_df.drop(columns=['Price (INR)'])

In [28]:
fact_df.head()

,Date,CustomerID,PromotionID,ProductID,Units Sold,Price Per Unit,Total Sales,Discount Percentage,Discount Value,Net Sales,Year,Month,Month Name
0,2020-02-04,10,0,P004,2,64999,NaN,NaN,NaN,NaN,2020,2,February
1,2022-05-19,28,PR001,P027,3,699,NaN,NaN,NaN,NaN,2022,5,May
2,2022-07-01,2,0,P011,3,1499,NaN,NaN,NaN,NaN,2022,7,July
3,2022-04-06,11,PR001,P009,2,3499,NaN,NaN,NaN,NaN,2022,4,April
4,2022-01-02,34,0,P002,1,69999,NaN,NaN,NaN,NaN,2022,1,January

In [29]:
fact_df['Total Sales'] = fact_df['Units Sold'] * fact_df['Price Per Unit']

In [30]:
fact_df[['Units Sold', 'Price Per Unit', 'Total Sales']].head()

   Units Sold  Price Per Unit  Total Sales
0           2           64999       129998
1           3             699         2097
2           3            1499         4497
3           2            3499         6998
4           1           69999        69999

In [31]:
fact_df['Total Sales'].describe()

count      3510.00000
mean      36892.89886
std       65009.75933
min          99.00000
25%        3499.00000
50%        8999.00000
75%       25998.00000
max      277497.00000
Name: Total Sales, dtype: float64

In [32]:
fact_df[fact_df['Total Sales'].isnull()]

Empty DataFrame
Columns: [Date, CustomerID, PromotionID, ProductID, Units Sold, Price Per Unit, Total Sales, Discount Percentage, Discount Value, Net Sales, Year, Month, Month Name]
Index: []

In [33]:

# Discount & Promotion Calculations

In [34]:
promotion_df.head()

,PromotionID,Promotion Name,Ad Type,Coupon Code,Price Reduction Type
0,PR001,Summer Sale,Email,SUMMER21,20% off
1,PR002,Festive Diwali,Social Media,FESTIVE2022,10% off
2,PR003,New Year Special,Website Banner,NEWYEAR22,60%off
3,PR004,Weekend Flash Sale,Mobile Push,FLASH50,50% off
4,PR005,Clearance Sale,In-App,CLEARANCE23,70% off

In [35]:
promotion_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   PromotionID           5 non-null      object
 1   Promotion Name        5 non-null      object
 2   Ad Type               5 non-null      object
 3   Coupon Code           5 non-null      object
 4   Price Reduction Type  5 non-null      object
dtypes: object(5)
memory usage: 332.0+ bytes

In [36]:
fact_df = fact_df.merge(
    promotion_df[['PromotionID', 'Price Reduction Type']],
    on='PromotionID',
    how='left'
)

In [37]:
fact_df['Discount Percentage'] = 0.0

In [38]:
fact_df['Price Reduction Type'] = (
    fact_df['Price Reduction Type']
    .astype(str)
    .str.strip()
    .str.lower()
)

In [39]:
# Reset
fact_df['Discount Percentage'] = 0.0
fact_df['Discount Value'] = 0.0

# Extract percentage wherever a number exists
fact_df['Discount Percentage'] = (
    fact_df['Price Reduction Type']
    .str.extract(r'(\d+)')
    .astype(float)
    .fillna(0) / 100
)

# Apply percentage discount ONLY where '%' exists
mask_percent = fact_df['Price Reduction Type'].str.contains('%')

fact_df.loc[mask_percent, 'Discount Value'] = (
    fact_df.loc[mask_percent, 'Total Sales'] *
    fact_df.loc[mask_percent, 'Discount Percentage']
)

In [40]:
fact_df['Net Sales'] = fact_df['Total Sales'] - fact_df['Discount Value']

In [41]:
fact_df[['Total Sales', 'Discount Value', 'Net Sales']].describe()

        Total Sales  Discount Value      Net Sales
count    3510.00000     3510.000000    3510.000000
mean    36892.89886     2047.707066   34845.191795
std     65009.75933    10135.061848   62168.532265
min        99.00000        0.000000      29.700000
25%      3499.00000        0.000000    2999.000000
50%      8999.00000        0.000000    8798.400000
75%     25998.00000        0.000000   25497.000000
max    277497.00000   194247.900000  277497.000000

In [42]:
fact_df.loc[
    fact_df['Price Reduction Type'].str.contains('Buy 1 Get 1', na=False),
    ['Units Sold', 'Price Per Unit', 'Total Sales', 'Discount Value', 'Net Sales']
].head()

Empty DataFrame
Columns: [Units Sold, Price Per Unit, Total Sales, Discount Value, Net Sales]
Index: []

In [43]:
# Exploratory Data Analysis (EDA)

In [44]:

# What are the Top & Bottom Products by Net Sales?
# Why business cares

# Top products â†’ push marketing, ensure inventory

# Bottom products â†’ fix pricing, promotion, or remove

In [45]:
product_sales = (
    fact_df
    .groupby('ProductID', as_index=False)['Net Sales']
    .sum()
)

In [46]:
top_5_products = product_sales.sort_values(
    by='Net Sales', ascending=False
).head(5)

top_5_products

  ProductID   Net Sales
0      P001  21439732.0
4      P005  19646787.6
2      P003  19358784.9
1      P002  15308781.3
3      P004  14351779.2

In [47]:
bottom_5_products = product_sales.sort_values(
    by='Net Sales', ascending=True
).head(5)

bottom_5_products

   ProductID  Net Sales
28      P029    21087.0
27      P028    81037.8
29      P030    82712.7
26      P027   167690.1
20      P021   259280.4

In [48]:
# 
# How do Net Sales change over time?
# Why business cares

# Growth or decline

# Seasonality

# Performance tracking
#

In [49]:
monthly_sales = (
    fact_df
    .groupby(fact_df['Date'].dt.to_period('M'))['Net Sales']
    .sum()
    .reset_index()
)

In [50]:
monthly_sales = monthly_sales.sort_values('Date')
monthly_sales.head()

      Date  Net Sales
0  2020-01  3039222.0
1  2020-02  2965411.0
2  2020-03  1896157.0
3  2020-04  3250838.4
4  2020-05  2041289.6

In [51]:

# Do discounts hurt or help revenue?
# Why this matters

# Discounts increase volume but may reduce revenue.

In [52]:
fact_df['Is Discounted'] = fact_df['Discount Value'] > 0

In [53]:
discount_impact = (
    fact_df
    .groupby('Is Discounted')['Net Sales']
    .sum()
    .reset_index()
)

discount_impact

   Is Discounted    Net Sales
0          False  102935585.0
1           True   19371038.2

In [54]:
#Which promotions are most effective?

In [55]:
promotion_performance = (
    fact_df
    .groupby('Price Reduction Type')['Net Sales']
    .sum()
    .reset_index()
    .sort_values('Net Sales', ascending=False)
)

promotion_performance

  Price Reduction Type    Net Sales
5                  nan  102935585.0
1              20% off   17038699.2
2              50% off    1873543.0
4              70% off     448242.0
0              10% off       5396.4
3               60%off       5157.6

In [56]:
fact_df['Price Reduction Type'] = fact_df['Price Reduction Type'].replace('nan', 'No Discount')

In [57]:
# What is the average order value?
# Why

# Shows customer spending behavior.

In [58]:
avg_order_value = fact_df['Net Sales'].mean()
avg_order_value

34845.1917948718

In [59]:
fact_sales_final = fact_df[
    [
        'Date',
        'CustomerID',
        'ProductID',
        'PromotionID',
        'Units Sold',
        'Price Per Unit',          # keep transactional price
        'Total Sales',
        'Discount Percentage',
        'Discount Value',
        'Net Sales',
        'Year',
        'Month',
        'Month Name',
        'Is Discounted'
    ]
]

# -------------------------------
# 2. Fix CustomerID naming issue
# -------------------------------
dim_customer_final = customer_df.rename(
    columns={'Customer ID': 'CustomerID'}
)

# -------------------------------
# 3. Export ONE warehouse workbook
#    (multiple sheets = tables)
# -------------------------------
with pd.ExcelWriter('warehouse_tables_final.xlsx') as writer:
    fact_sales_final.to_excel(writer, sheet_name='fact_sales', index=False)
    product_df.to_excel(writer, sheet_name='dim_product', index=False)
    dim_customer_final.to_excel(writer, sheet_name='dim_customer', index=False)
    promotion_df.to_excel(writer, sheet_name='dim_promotion', index=False)